In [40]:
import pandas as pd
import numpy as np

## Creating a New DataFrame

In [41]:
data = np.arange(0,20).reshape(5,4)
index = ['Row1', 'Row2', 'Row3', 'Row4', 'Row5']
columns = ['Col1', 'Col2', 'Col3', 'Col4']

In [42]:
df = pd.DataFrame(data, index, columns)
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [43]:
# Copying the dataframe to a csv file
df.to_csv('res/test.csv')

# Accessing the elements
### 1. loc - returns Series
### 2. iloc - returns both DataFrame and Series

In [44]:
df.loc['Row1']

Col1    0
Col2    1
Col3    2
Col4    3
Name: Row1, dtype: int32

In [45]:
type(df.loc['Row1'])

pandas.core.series.Series

In [46]:
df.iloc[:,0]

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Col1, dtype: int32

In [47]:
df.iloc[2:3, 2:4]

      Col3  Col4
Row3    10    11

In [48]:
type(df.iloc[2:3, 2:4])

pandas.core.frame.DataFrame

In [49]:
#Converting data frame to array

df.iloc[2:3, 2:4].values

array([[10, 11]])

In [50]:
# Checking null  
df.isnull().sum()

Col1    0
Col2    0
Col3    0
Col4    0
dtype: int64

In [51]:
# Checking count of different values
df['Col1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: Col1, dtype: int64

In [52]:
# Checking all distinct values
df['Col1'].unique()

array([ 0,  4,  8, 12, 16])

## Reading csv file using pandas

In [53]:
df = pd.read_csv('res/mercedesbenz.csv')

In [54]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [56]:
#only int and float cols are considered; not object cols; % are percentiles
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [57]:
df_test = pd.read_csv('res/test.csv', sep = ';')

In [58]:
df_test.head()

  ,Col1,Col2,Col3,Col4
0         Row1,0,1,2,3
1         Row2,4,5,6,7
2       Row3,8,9,10,11
3     Row4,12,13,14,15
4     Row5,16,17,18,19

In [59]:
df['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
ai     34
m      34
e      32
ba     27
at     25
a      21
ax     19
am     18
i      18
aq     18
u      17
l      16
aw     16
ad     14
k      11
b      11
au     11
r      10
as     10
bc      6
ao      4
c       3
q       2
aa      2
ab      1
ac      1
g       1
Name: X0, dtype: int64

In [60]:
from io import StringIO, BytesIO

In [61]:
data = ('''Col1;Col2;Col3;Col4
Row1;1;1;2;3
Row2;4;5;6;7
Row3;8;9;10;11
Row4;12;13;14;15
Row5;16;17;18;19''')

In [62]:
type(data)

str

In [63]:
pd.read_csv(StringIO(data), sep=';')

      Col1  Col2  Col3  Col4
Row1     1     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [64]:
df_testString = pd.read_csv(StringIO(data), sep=';', usecols= ['Col1', 'Col4']) 
df_testString

      Col1  Col4
Row1     1     3
Row2     4     7
Row3     8    11
Row4    12    15
Row5    16    19

In [65]:
df_testString.to_csv('res/test_String.csv')

In [66]:
df_testString = pd.read_csv(StringIO(data), sep=';', usecols= ['Col1', 'Col4'], dtype=object) 
df_testString['Col1']['Row1']

'1'

In [67]:
data = (''';Col1;Col2;Col3;Col4
Row1;1;1;2;3
Row2;4;5;6;7
Row3;8;9;10;11
Row4;12;13;14;15
Row5;16;17;18;19''')

In [68]:
df_testString = pd.read_csv(StringIO(data), sep=';', usecols= ['Col2', 'Col3', 'Col4'],dtype={'Col2':float, 'Col3':int, 'Col4':'Int64'}) 
df_testString

   Col2  Col3  Col4
0   1.0     2     3
1   5.0     6     7
2   9.0    10    11
3  13.0    14    15
4  17.0    18    19

In [69]:
df_testString.dtypes

Col2    float64
Col3      int32
Col4      Int64
dtype: object

In [70]:
data = ('Col1;Col2;Col3;Col4;Col5\n'+
        '11;1;1;2;3\n'
        '12;4;5;6;7\n'+
        '13;8;9;10;11\n'+
        '14;12;13;14;15\n'+
        '15;16;17;18;19\n')

In [71]:
df_testString = pd.read_csv(StringIO(data), sep=';', index_col=False)
df_testString

   Col1  Col2  Col3  Col4  Col5
0    11     1     1     2     3
1    12     4     5     6     7
2    13     8     9    10    11
3    14    12    13    14    15
4    15    16    17    18    19

In [72]:
df_testString = pd.read_csv(StringIO(data), sep=';', index_col=0)
df_testString

      Col2  Col3  Col4  Col5
Col1
11       1     1     2     3
12       4     5     6     7
13       8     9    10    11
14      12    13    14    15
15      16    17    18    19

## Reading JSON to CSV

In [73]:
data_json = '{"empName":"emp1", "email":"emp1@company.com", "profile":[{"title":"Team Lead", "Tech":"Data Scientist"}]}'
data_json

'{"empName":"emp1", "email":"emp1@company.com", "profile":[{"title":"Team Lead", "Tech":"Data Scientist"}]}'

In [74]:
df_json = pd.read_json(data_json)
df_json

  empName             email                                           profile
0    emp1  emp1@company.com  {'title': 'Team Lead', 'Tech': 'Data Scientist'}

## Reading HTML to CSV
#### It reads the table tag data from the html page and converts it to CSV data

In [75]:
#Single Table in HTML Page
url = 'https://www.fdic.gov/bank/individual/failed/banklist.html'
df_html = pd.read_html(url)
print("Number of tables in df_html: {}".format(len(df_html)))
df_html[0].to_csv('res/htmlDataToCSV.csv')
df_html

Number of tables in df_html: 1

[                             Bank Name           City  ST   CERT  \
 0                 The First State Bank  Barboursville  WV  14361
 1                   Ericson State Bank        Ericson  NE  18265
 2     City National Bank of New Jersey         Newark  NJ  21111
 3                        Resolute Bank         Maumee  OH  58317
 4                Louisa Community Bank         Louisa  KY  58112
 ..                                 ...            ...  ..    ...
 556                 Superior Bank, FSB       Hinsdale  IL  32646
 557                Malta National Bank          Malta  OH   6629
 558    First Alliance Bank & Trust Co.     Manchester  NH  34264
 559  National State Bank of Metropolis     Metropolis  IL   3815
 560                   Bank of Honolulu       Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                         MVB Bank, Inc.      April 3, 2020
 1             Farmers and Merchants Bank  February 14, 2020
 2                        Industrial Bank   November 1, 2019
 3                     Buckeye State Bank   October 25, 2019
 4      Kentucky Farmers Bank Corporation   October 25, 2019
 ..                                   ...                ...
 556                Superior Federal, FSB      July 27, 2001
 557                    North Valley Bank        May 3, 2001
 558  Southern New Hampshire Bank & Trust   February 2, 2001
 559              Banterra Bank of Marion  December 14, 2000
 560                   Bank of the Orient   October 13, 2000

 [561 rows x 6 columns]]

In [76]:
#Multiple Tables in HTML Page
url = 'https://en.wikipedia.org/wiki/Mobile_country_code'
df_html = pd.read_html(url)
print(type(df_html))
print("Number of tables in df_html: {}".format(len(df_html)))
for i in range(0, len(df_html)):
    fileName = "res/wikiTable_1_"+ str(i)+ ".csv"
    print(fileName)
    df_html[i].to_csv(fileName)
df_html

<class 'list'>
Number of tables in df_html: 5
res/wikiTable_1_0.csv
res/wikiTable_1_1.csv
res/wikiTable_1_2.csv
res/wikiTable_1_3.csv
res/wikiTable_1_4.csv

[   MCC  MNC Brand      Operator       Status Bands (MHz)  \
 0    1    1  TEST  Test network  Operational         any
 1    1    1  TEST  Test network  Operational         any
 2  999   99   NaN  Internal use  Operational         any
 3  999  999   NaN  Internal use  Operational         any

                               References and notes
 0                                              NaN
 1                                              NaN
 2  Internal use in private networks, no roaming[4]
 3  Internal use in private networks, no roaming[4]  ,
      Mobile country code                                    Country ISO 3166  \
 0                    289                                 A Abkhazia    GE-AB
 1                    412                                Afghanistan       AF
 2                    276                                    Albania       AL
 3                    603                                    Algeria       DZ
 4                    544  American Samoa (United States of America)       AS
 ..                   ...                                        ...      ...
 247                  452                                    Vietnam       VN
 248                  543                        W Wallis and Futuna       WF
 249                  421                                    Y Yemen       YE
 250                  645                                   Z Zambia       ZM
 251                  648                                   Zimbabwe       ZW

                                   Mobile network codes National MNC authority  \
 0             List of mobile network codes in Abkhazia                    NaN
 1          List of mobile network codes in Afghanistan                    NaN
 2              List of mobile network codes in Albania                    NaN
 3              List of mobile network codes in Algeria                    NaN
 4       List of mobile network codes in American Samoa                    NaN
 ..                                                 ...                    ...
 247        List of mobile network codes in the Vietnam                    NaN
 248  List of mobile network codes in Wallis and Futuna                    NaN
 249          List of mobile network codes in the Yemen                    NaN
 250             List of mobile network codes in Zambia                    NaN
 251           List of mobile network codes in Zimbabwe                    NaN

                       Remarks
 0    MCC is not listed by ITU
 1                         NaN
 2                         NaN
 3                         NaN
 4                         NaN
 ..                        ...
 247                       NaN
 248                       NaN
 249                       NaN
 250                       NaN
 251                       NaN

 [252 rows x 6 columns],
     MCC  MNC     Brand                                           Operator  \
 0   901    1       ICO                           ICO Satellite Management
 1   901    2       NaN                                         Unassigned
 2   901    3   Iridium                                                NaN
 3   901    4       NaN                                         Unassigned
 4   901    5       NaN                               Thuraya RMSS Network
 ..  ...  ...       ...                                                ...
 76  901   77       NaN                                   Bouygues Telecom
 77  901   88       NaN  UN Office for the Coordination of Humanitarian...
 78  902    1       NaN                                MulteFire Allicance
 79  991    1       NaN                             World's Global Telecom
 80  991    2  5G Croco                                        Orange S.A.

              Status Bands (MHz)  \
 0   Not operational   Satellite
 1    Returned spare     Unknown
 2       Operational   Satellite
 3    Returned spare   Satellite
 4       Operational   Satellite
 ..              ...         ...
 76          Unknown     Unknown
 77          Unknown     Unknown
 78      Operational         LTE
 79          Unknown     Unknown
 80          Unknown          5G

                                  References and notes
 0                                   MNC withdrawn[45]
 1        Formerly: Sense Communications International
 2                                                 NaN
 3                                Formerly: Globalstar
 4                                                 NaN
 ..                                                ...
 76                                               [86]
 77                                               [87]
 78                                                [4]
 79  temporarily assigned until 15 January 2021[80]...
 80       temporarily assigned until 6 August 2021[89]

 [81 rows x 7 columns],
    MCC  MNC     Brand                 Operator       Status Bands (MHz)  \
 0  995    1  FonePlus  Sure (Diego Garcia) Ltd  Operational     GSM 900

                                 References and notes
 0  There appears to be no officially assigned MCC...  ,
                 vteTelecommunications  \
 0                             History
 1                            Pioneers
 2                   Transmissionmedia
 3       Network topologyand switching
 4                        Multiplexing
 5                            Concepts
 6                    Types of network
 7                    Notable networks
 8              Locations (by regions)
 9  Category  Outline  Portal  Commons

                              vteTelecommunications.1  \
 0  Beacon Broadcasting Cable protection system Ca...
 1  Nasir Ahmed Edwin Howard Armstrong Mohamed M. ...
 2  Coaxial cable Fiber-optic communication optica...
 3  Bandwidth Links Nodes terminal Network switchi...
 4  Space-division Frequency-division Time-divisio...
 5  Communication protocols Computer network Data ...
 6  Cellular network Ethernet ISDN LAN Mobile NGN ...
 7  ARPANET BITNET CYCLADES FidoNet Internet Inter...
 8  Africa Americas North South Antarctica Asia Eu...
 9                 Category  Outline  Portal  Commons

               vteTelecommunications.2
 0                                 NaN
 1                                 NaN
 2                                 NaN
 3                                 NaN
 4                                 NaN
 5                                 NaN
 6                                 NaN
 7                                 NaN
 8                                 NaN
 9  Category  Outline  Portal  Commons  ]

In [77]:
#Multiple Tables in HTML Page - reading the table with particular column name
url = 'https://en.wikipedia.org/wiki/Mobile_country_code'
df_html = pd.read_html(url, match = 'Operator')
print(type(df_html))
print("Number of tables in df_html: {}".format(len(df_html)))
for i in range(0, len(df_html)):
    fileName = "res/wikitable_2_"+ str(i)+ ".json"
    print(fileName)
    df_html[i].to_json(fileName)
df_html

<class 'list'>
Number of tables in df_html: 3
res/wikitable_2_0.json
res/wikitable_2_1.json
res/wikitable_2_2.json

[   MCC  MNC Brand      Operator       Status Bands (MHz)  \
 0    1    1  TEST  Test network  Operational         any
 1    1    1  TEST  Test network  Operational         any
 2  999   99   NaN  Internal use  Operational         any
 3  999  999   NaN  Internal use  Operational         any

                               References and notes
 0                                              NaN
 1                                              NaN
 2  Internal use in private networks, no roaming[4]
 3  Internal use in private networks, no roaming[4]  ,
     MCC  MNC     Brand                                           Operator  \
 0   901    1       ICO                           ICO Satellite Management
 1   901    2       NaN                                         Unassigned
 2   901    3   Iridium                                                NaN
 3   901    4       NaN                                         Unassigned
 4   901    5       NaN                               Thuraya RMSS Network
 ..  ...  ...       ...                                                ...
 76  901   77       NaN                                   Bouygues Telecom
 77  901   88       NaN  UN Office for the Coordination of Humanitarian...
 78  902    1       NaN                                MulteFire Allicance
 79  991    1       NaN                             World's Global Telecom
 80  991    2  5G Croco                                        Orange S.A.

              Status Bands (MHz)  \
 0   Not operational   Satellite
 1    Returned spare     Unknown
 2       Operational   Satellite
 3    Returned spare   Satellite
 4       Operational   Satellite
 ..              ...         ...
 76          Unknown     Unknown
 77          Unknown     Unknown
 78      Operational         LTE
 79          Unknown     Unknown
 80          Unknown          5G

                                  References and notes
 0                                   MNC withdrawn[45]
 1        Formerly: Sense Communications International
 2                                                 NaN
 3                                Formerly: Globalstar
 4                                                 NaN
 ..                                                ...
 76                                               [86]
 77                                               [87]
 78                                                [4]
 79  temporarily assigned until 15 January 2021[80]...
 80       temporarily assigned until 6 August 2021[89]

 [81 rows x 7 columns],
    MCC  MNC     Brand                 Operator       Status Bands (MHz)  \
 0  995    1  FonePlus  Sure (Diego Garcia) Ltd  Operational     GSM 900

                                 References and notes
 0  There appears to be no officially assigned MCC...  ]

# Reading Excel to CSV

In [78]:
df_excel = pd.read_excel('res/excelSample.xlsx', sheet_name = 'sample1')
df_excel

   1   6   11
0   2   7  12
1   3   8  13
2   4   9  14
3   5  10  15